flagsmith/2024-08-20--00001--staging/server-eval-report.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: server_eval_script.js
 web dashboard: http://127.0.0.1:5665
        output: -

     scenarios: (100.00%) 1 scenario, 150 max VUs, 1m0s max duration (incl. graceful stop):
              * default: Up to 150 looping VUs for 30s over 1 stages (gracefulRampDown: 10s, gracefulStop: 30s)


     ✓ status is 200
     ✗ flag should be true
      ↳  94% — ✓ 563 / ✗ 33

     checks.........................: 97.23% ✓ 1159      ✗ 33   
     data_received..................: 1.3 MB 33 kB/s
     data_sent......................: 113 kB 2.9 kB/s
     http_req_blocked...............: avg=26.63ms min=124ns    med=304ns   max=1.11s    p(90)=64.28ms p(95)=77.18ms 
     http_req_connecting............: avg=15.16ms min=0s       med=0s      max=1.05s    p(90)=25.9ms  p(95)=35.72ms 
     http_req_duration..............: avg=4.08s   min=117.15ms med=3.32s   max=10.29s   p(90)=8.97s   p(95)=10.03s  
       { expected_response:true }...: avg=4.08s   min=117.15ms med=3.32s   max=10.29s   p(90)=8.97s   p(95)=10.03s  
     http_req_failed................: 0.00%  ✓ 0         ✗ 596  
     http_req_receiving.............: avg=53.37µs min=19.2µs   med=52.33µs max=130.54µs p(90)=72.25µs p(95)=82.43µs 
     http_req_sending...............: avg=64.61µs min=20.03µs  med=61.09µs max=210.63µs p(90)=98.95µs p(95)=111.99µs
     http_req_tls_handshaking.......: avg=10.79ms min=0s       med=0s      max=465.84ms p(90)=30.13ms p(95)=38.98ms 
     http_req_waiting...............: avg=4.08s   min=117.02ms med=3.32s   max=10.29s   p(90)=8.97s   p(95)=10.03s  
     http_reqs......................: 596    15.150473/s
     iteration_duration.............: avg=5.11s   min=1.16s    med=4.33s   max=11.31s   p(90)=10s     p(95)=11.04s  
     iterations.....................: 596    15.150473/s
     vus............................: 5      min=5       max=149
     vus_max........................: 150    min=150     max=150


running (0m39.3s), 000/150 VUs, 596 complete and 0 interrupted iterations
default ✓ [======================================] 000/150 VUs  30s